<a href="https://colab.research.google.com/github/sruthib22/data690_Sruthi/blob/main/assignment_04/in_class_session_practice_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## in class practice pandas
 - sruthi 
 - 23rd september

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("/content/census_costs.txt", sep="\t")

In [4]:
df.head()

  Census Year Total Population Census Cost Average Cost Per Person
0        1790        3,929,214     $44,377              1.13 cents
1        1800        5,308,483     $66,109              1.24 cents
2        1810        7,239,881    $178,445              2.46 cents
3        1820        9,633,822    $208,526              2.16 cents
4        1830       12,866,020    $378,545              2.94 cents

In [5]:
df.tail(3)

   Census Year Total Population     Census Cost Average Cost Per Person
20        1990      248,718,301  $2,492,830,000                  $10.02
21        2000      281,421,906    $4.5 Billion                  $15.99
22       2010*      308,745,538     $13 Billion                  $42.11

In [6]:
df.sample()

   Census Year Total Population  Census Cost Average Cost Per Person
13        1920      105,710,620  $25,117,000             23.76 cents

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
dtypes: object(4)
memory usage: 864.0+ bytes

In [8]:

df.describe()

       Census Year Total Population  Census Cost Average Cost Per Person
count           23               23           23                      23
unique          23               23           23                      23
top           1830      179,323,175  $11,854,000                  $10.02
freq             1                1            1                       1

In [9]:
x = 17,169,458
print(type(x))

<class 'tuple'>

In [10]:
y = "123,456,789"

z = y.replace(",", "")

print(z)

type(z)

123456789

str

In [11]:
a= int(z)

print(a)

type(a)

123456789

int

In [12]:

df[["Census Year","Total Population"]]

   Census Year Total Population
0         1790        3,929,214
1         1800        5,308,483
2         1810        7,239,881
3         1820        9,633,822
4         1830       12,866,020
5         1840       17,069,458
6         1850       23,191,876
7         1860       31,443,321
8         1870       38,558,371
9         1880       50,155,783
10        1890       62,979,766
11        1900       76,303,387
12        1910       91,972,266
13        1920      105,710,620
14        1930      122,775,046
15        1940      131,669,275
16        1950      151,325,798
17        1960      179,323,175
18        1970      203,302,031
19        1980      226,542,199
20        1990      248,718,301
21        2000      281,421,906
22       2010*      308,745,538

In [13]:
# There is difference between series and data frame.
# df["Total Population"] return a series which has a tolist() function
# df[["Total Population"]] return a data frame which has no tolist() function

pop_list = df["Total Population"].tolist()
pop_list

['3,929,214',
 '5,308,483',
 '7,239,881',
 '9,633,822',
 '12,866,020',
 '17,069,458',
 '23,191,876',
 '31,443,321',
 '38,558,371',
 '50,155,783',
 '62,979,766',
 '76,303,387',
 '91,972,266',
 '105,710,620',
 '122,775,046',
 '131,669,275',
 '151,325,798',
 '179,323,175',
 '203,302,031',
 '226,542,199',
 '248,718,301',
 '281,421,906',
 '308,745,538']

In [14]:
pop_list2 = [int(pop.replace(",","")) for pop in pop_list]
pop_list2

[3929214,
 5308483,
 7239881,
 9633822,
 12866020,
 17069458,
 23191876,
 31443321,
 38558371,
 50155783,
 62979766,
 76303387,
 91972266,
 105710620,
 122775046,
 131669275,
 151325798,
 179323175,
 203302031,
 226542199,
 248718301,
 281421906,
 308745538]

In [15]:
def cleanse_pop(a_string):
  return int(a_string.replace(",",""))


cleanse_pop("123,456")

123456

In [16]:

df["tot_pop"] = df["Total Population"].apply(cleanse_pop)

df.head()

  Census Year Total Population Census Cost Average Cost Per Person   tot_pop
0        1790        3,929,214     $44,377              1.13 cents   3929214
1        1800        5,308,483     $66,109              1.24 cents   5308483
2        1810        7,239,881    $178,445              2.46 cents   7239881
3        1820        9,633,822    $208,526              2.16 cents   9633822
4        1830       12,866,020    $378,545              2.94 cents  12866020

In [17]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
 4   tot_pop                  23 non-null     int64
dtypes: int64(1), object(4)
memory usage: 1.0+ KB

In [18]:
df.describe()

            tot_pop
count  2.300000e+01
mean   1.039211e+08
std    9.622629e+07
min    3.929214e+06
25%    2.013067e+07
50%    7.630339e+07
75%    1.653245e+08
max    3.087455e+08

In [19]:
df.describe(include = "all")

       Census Year Total Population  ... Average Cost Per Person       tot_pop
count           23               23  ...                      23  2.300000e+01
unique          23               23  ...                      23           NaN
top           1830      179,323,175  ...                  $10.02           NaN
freq             1                1  ...                       1           NaN
mean           NaN              NaN  ...                     NaN  1.039211e+08
std            NaN              NaN  ...                     NaN  9.622629e+07
min            NaN              NaN  ...                     NaN  3.929214e+06
25%            NaN              NaN  ...                     NaN  2.013067e+07
50%            NaN              NaN  ...                     NaN  7.630339e+07
75%            NaN              NaN  ...                     NaN  1.653245e+08
max            NaN              NaN  ...                     NaN  3.087455e+08

[11 rows x 5 columns]